In [1]:
import os, sys
from pyspark.sql import SparkSession

In [2]:
os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

In [3]:
spark = SparkSession.builder.master("local[*]").appName("Example_3").getOrCreate()

In [4]:
data = [
    ("John", "IT", 45000),
    ("Max", "IT", 50000),
    ("Shawn", "HR", 35000),
    ("Nick", "HR", 25000),
    ("Tom", "IT", 75000),
    ("Matt", "IT", 85000),
    ("Jeff", "HR", 105000),
    ("Chris", "IT", 40000),
    ("Tom", "IT", 45000),
]

In [5]:
# Create DataFrame using RDD

rdd = spark.sparkContext.parallelize(data)

In [6]:
df = rdd.toDF()

In [7]:
df.show()

+-----+---+------+
|   _1| _2|    _3|
+-----+---+------+
| John| IT| 45000|
|  Max| IT| 50000|
|Shawn| HR| 35000|
| Nick| HR| 25000|
|  Tom| IT| 75000|
| Matt| IT| 85000|
| Jeff| HR|105000|
|Chris| IT| 40000|
|  Tom| IT| 45000|
+-----+---+------+

In [8]:
columns = ['Name', 'Department', 'Salary']
df_2 = rdd.toDF(columns)

In [9]:
df_2.show()

+-----+----------+------+
| Name|Department|Salary|
+-----+----------+------+
| John|        IT| 45000|
|  Max|        IT| 50000|
|Shawn|        HR| 35000|
| Nick|        HR| 25000|
|  Tom|        IT| 75000|
| Matt|        IT| 85000|
| Jeff|        HR|105000|
|Chris|        IT| 40000|
|  Tom|        IT| 45000|
+-----+----------+------+

In [10]:
df_2.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: long (nullable = true)

In [11]:
# create dataframe using SparkSession
df_2 = spark.createDataFrame(rdd).toDF(*columns)

In [12]:
df_2.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: long (nullable = true)

In [13]:
# Create DataFrame with Schema

In [14]:
from pyspark.sql.types import StructType, StringType, IntegerType, StructField

In [15]:
data = [
    ("John", "IT", 45000, "M"),
    ("Max", "IT", 50000, "M"),
    ("Shawn", "HR", 35000, "M"),
    ("Nick", "HR", 25000, "M"),
    ("Jenny", "IT", 75000, "F"),
    ("Tina", "IT", 85000, "F"),
    ("Nat", "HR", 105000, ""),
    ("Chris", "IT", 40000, "M"),
    ("Tom", "IT", 45000, "M"),
]

schema = StructType([
    StructField("Emp Name", StringType()),
    StructField("Emp Dept", StringType()),
    StructField("Emp Salary", IntegerType()),
    StructField("Emp Gender", StringType())
])

In [16]:
schema

StructType(List(StructField(Emp Name,StringType,true),StructField(Emp Dept,StringType,true),StructField(Emp Salary,IntegerType,true),StructField(Emp Gender,StringType,true)))

In [17]:
df = spark.createDataFrame(data=data, schema=schema)

In [18]:
df.printSchema()

root
 |-- Emp Name: string (nullable = true)
 |-- Emp Dept: string (nullable = true)
 |-- Emp Salary: integer (nullable = true)
 |-- Emp Gender: string (nullable = true)

In [19]:
df.show()

+--------+--------+----------+----------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|
+--------+--------+----------+----------+
|    John|      IT|     45000|         M|
|     Max|      IT|     50000|         M|
|   Shawn|      HR|     35000|         M|
|    Nick|      HR|     25000|         M|
|   Jenny|      IT|     75000|         F|
|    Tina|      IT|     85000|         F|
|     Nat|      HR|    105000|          |
|   Chris|      IT|     40000|         M|
|     Tom|      IT|     45000|         M|
+--------+--------+----------+----------+

In [24]:
# Create DataFrame using CSV
df_2 = spark.read.csv('summer.csv',header=True)

In [25]:
df_2.head()

Row(Year='1896', City='Athens', Sport='Aquatics', Discipline='Swimming', Athlete='HAJOS, Alfred', Country='HUN', Gender='Men', Event='100M Freestyle', Medal='Gold')

In [26]:
df_2.head(5)

[Row(Year='1896', City='Athens', Sport='Aquatics', Discipline='Swimming', Athlete='HAJOS, Alfred', Country='HUN', Gender='Men', Event='100M Freestyle', Medal='Gold'),
 Row(Year='1896', City='Athens', Sport='Aquatics', Discipline='Swimming', Athlete='HERSCHMANN, Otto', Country='AUT', Gender='Men', Event='100M Freestyle', Medal='Silver'),
 Row(Year='1896', City='Athens', Sport='Aquatics', Discipline='Swimming', Athlete='DRIVAS, Dimitrios', Country='GRE', Gender='Men', Event='100M Freestyle For Sailors', Medal='Bronze'),
 Row(Year='1896', City='Athens', Sport='Aquatics', Discipline='Swimming', Athlete='MALOKINIS, Ioannis', Country='GRE', Gender='Men', Event='100M Freestyle For Sailors', Medal='Gold'),
 Row(Year='1896', City='Athens', Sport='Aquatics', Discipline='Swimming', Athlete='CHASAPIS, Spiridon', Country='GRE', Gender='Men', Event='100M Freestyle For Sailors', Medal='Silver')]

In [27]:
df_2.show(5)

+----+------+--------+----------+------------------+-------+------+--------------------+------+
|Year|  City|   Sport|Discipline|           Athlete|Country|Gender|               Event| Medal|
+----+------+--------+----------+------------------+-------+------+--------------------+------+
|1896|Athens|Aquatics|  Swimming|     HAJOS, Alfred|    HUN|   Men|      100M Freestyle|  Gold|
|1896|Athens|Aquatics|  Swimming|  HERSCHMANN, Otto|    AUT|   Men|      100M Freestyle|Silver|
|1896|Athens|Aquatics|  Swimming| DRIVAS, Dimitrios|    GRE|   Men|100M Freestyle Fo...|Bronze|
|1896|Athens|Aquatics|  Swimming|MALOKINIS, Ioannis|    GRE|   Men|100M Freestyle Fo...|  Gold|
|1896|Athens|Aquatics|  Swimming|CHASAPIS, Spiridon|    GRE|   Men|100M Freestyle Fo...|Silver|
+----+------+--------+----------+------------------+-------+------+--------------------+------+
only showing top 5 rows

In [49]:
# print shape of data frame
df_2.count(), len(df_2.dtypes)

(31165, 9)

In [28]:
top_5 = df_2.take(5)

In [30]:
df_2.tail(5)

[Row(Year='2012', City='London', Sport='Wrestling', Discipline='Wrestling Freestyle', Athlete='JANIKOWSKI, Damian', Country='POL', Gender='Men', Event='Wg 84 KG', Medal='Bronze'),
 Row(Year='2012', City='London', Sport='Wrestling', Discipline='Wrestling Freestyle', Athlete='REZAEI, Ghasem Gholamreza', Country='IRI', Gender='Men', Event='Wg 96 KG', Medal='Gold'),
 Row(Year='2012', City='London', Sport='Wrestling', Discipline='Wrestling Freestyle', Athlete='TOTROV, Rustam', Country='RUS', Gender='Men', Event='Wg 96 KG', Medal='Silver'),
 Row(Year='2012', City='London', Sport='Wrestling', Discipline='Wrestling Freestyle', Athlete='ALEKSANYAN, Artur', Country='ARM', Gender='Men', Event='Wg 96 KG', Medal='Bronze'),
 Row(Year='2012', City='London', Sport='Wrestling', Discipline='Wrestling Freestyle', Athlete='LIDBERG, Jimmy', Country='SWE', Gender='Men', Event='Wg 96 KG', Medal='Bronze')]

In [34]:
df_2.limit(5).show()

+----+------+--------+----------+------------------+-------+------+--------------------+------+
|Year|  City|   Sport|Discipline|           Athlete|Country|Gender|               Event| Medal|
+----+------+--------+----------+------------------+-------+------+--------------------+------+
|1896|Athens|Aquatics|  Swimming|     HAJOS, Alfred|    HUN|   Men|      100M Freestyle|  Gold|
|1896|Athens|Aquatics|  Swimming|  HERSCHMANN, Otto|    AUT|   Men|      100M Freestyle|Silver|
|1896|Athens|Aquatics|  Swimming| DRIVAS, Dimitrios|    GRE|   Men|100M Freestyle Fo...|Bronze|
|1896|Athens|Aquatics|  Swimming|MALOKINIS, Ioannis|    GRE|   Men|100M Freestyle Fo...|  Gold|
|1896|Athens|Aquatics|  Swimming|CHASAPIS, Spiridon|    GRE|   Men|100M Freestyle Fo...|Silver|
+----+------+--------+----------+------------------+-------+------+--------------------+------+

In [35]:
df_2.limit(5).toPandas()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [36]:
# select columns by name
df_2.select("Year","Sport","Athlete","Medal").show(5)

+----+--------+------------------+------+
|Year|   Sport|           Athlete| Medal|
+----+--------+------------------+------+
|1896|Aquatics|     HAJOS, Alfred|  Gold|
|1896|Aquatics|  HERSCHMANN, Otto|Silver|
|1896|Aquatics| DRIVAS, Dimitrios|Bronze|
|1896|Aquatics|MALOKINIS, Ioannis|  Gold|
|1896|Aquatics|CHASAPIS, Spiridon|Silver|
+----+--------+------------------+------+
only showing top 5 rows

In [37]:
df_2.select(df_2.Year, df_2.Athlete).show(5)

+----+------------------+
|Year|           Athlete|
+----+------------------+
|1896|     HAJOS, Alfred|
|1896|  HERSCHMANN, Otto|
|1896| DRIVAS, Dimitrios|
|1896|MALOKINIS, Ioannis|
|1896|CHASAPIS, Spiridon|
+----+------------------+
only showing top 5 rows

In [39]:
# access columns by index
df_2.select(df_2.columns[:3]).show(5)

+----+------+--------+
|Year|  City|   Sport|
+----+------+--------+
|1896|Athens|Aquatics|
|1896|Athens|Aquatics|
|1896|Athens|Aquatics|
|1896|Athens|Aquatics|
|1896|Athens|Aquatics|
+----+------+--------+
only showing top 5 rows

In [40]:
df_2.select(df_2.columns[3:6]).show(5)

+----------+------------------+-------+
|Discipline|           Athlete|Country|
+----------+------------------+-------+
|  Swimming|     HAJOS, Alfred|    HUN|
|  Swimming|  HERSCHMANN, Otto|    AUT|
|  Swimming| DRIVAS, Dimitrios|    GRE|
|  Swimming|MALOKINIS, Ioannis|    GRE|
|  Swimming|CHASAPIS, Spiridon|    GRE|
+----------+------------------+-------+
only showing top 5 rows

In [42]:
df_2.collect()[5]

Row(Year='1896', City='Athens', Sport='Aquatics', Discipline='Swimming', Athlete='CHOROPHAS, Efstathios', Country='GRE', Gender='Men', Event='1200M Freestyle', Medal='Bronze')

In [43]:
df_2.collect()[5][3]

'Swimming'

In [50]:
from pyspark.sql.functions import col, lit

In [53]:
df_2.printSchema()

root
 |-- Year: string (nullable = true)
 |-- City: string (nullable = true)
 |-- Sport: string (nullable = true)
 |-- Discipline: string (nullable = true)
 |-- Athlete: string (nullable = true)
 |-- Country: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Event: string (nullable = true)
 |-- Medal: string (nullable = true)

In [54]:
# Alter Columns - withColumn

# Type Cast a column
df_2 = df_2.withColumn("Year", col("Year").cast("Integer"))

In [55]:
df_2.printSchema()

root
 |-- Year: integer (nullable = true)
 |-- City: string (nullable = true)
 |-- Sport: string (nullable = true)
 |-- Discipline: string (nullable = true)
 |-- Athlete: string (nullable = true)
 |-- Country: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Event: string (nullable = true)
 |-- Medal: string (nullable = true)

In [57]:
# Update the column
# df.withColumn("Emp Salary", col("Emp Salary") + 5000).show()

# Add new column
df.withColumn("Total Salary", col("Emp Salary") + 5000).show()

+--------+--------+----------+----------+------------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|Total Salary|
+--------+--------+----------+----------+------------+
|    John|      IT|     45000|         M|       50000|
|     Max|      IT|     50000|         M|       55000|
|   Shawn|      HR|     35000|         M|       40000|
|    Nick|      HR|     25000|         M|       30000|
|   Jenny|      IT|     75000|         F|       80000|
|    Tina|      IT|     85000|         F|       90000|
|     Nat|      HR|    105000|          |      110000|
|   Chris|      IT|     40000|         M|       45000|
|     Tom|      IT|     45000|         M|       50000|
+--------+--------+----------+----------+------------+

In [58]:
# Drop a column
df.drop("Emp Gender").show()

+--------+--------+----------+
|Emp Name|Emp Dept|Emp Salary|
+--------+--------+----------+
|    John|      IT|     45000|
|     Max|      IT|     50000|
|   Shawn|      HR|     35000|
|    Nick|      HR|     25000|
|   Jenny|      IT|     75000|
|    Tina|      IT|     85000|
|     Nat|      HR|    105000|
|   Chris|      IT|     40000|
|     Tom|      IT|     45000|
+--------+--------+----------+

In [59]:
df.withColumn("Emp City", lit("Delhi")).show(5)

+--------+--------+----------+----------+--------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|Emp City|
+--------+--------+----------+----------+--------+
|    John|      IT|     45000|         M|   Delhi|
|     Max|      IT|     50000|         M|   Delhi|
|   Shawn|      HR|     35000|         M|   Delhi|
|    Nick|      HR|     25000|         M|   Delhi|
|   Jenny|      IT|     75000|         F|   Delhi|
+--------+--------+----------+----------+--------+
only showing top 5 rows

In [62]:
df = df.withColumn("Emp City", lit("Delhi"))

In [63]:
df.show()

+--------+--------+----------+----------+--------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|Emp City|
+--------+--------+----------+----------+--------+
|    John|      IT|     45000|         M|   Delhi|
|     Max|      IT|     50000|         M|   Delhi|
|   Shawn|      HR|     35000|         M|   Delhi|
|    Nick|      HR|     25000|         M|   Delhi|
|   Jenny|      IT|     75000|         F|   Delhi|
|    Tina|      IT|     85000|         F|   Delhi|
|     Nat|      HR|    105000|          |   Delhi|
|   Chris|      IT|     40000|         M|   Delhi|
|     Tom|      IT|     45000|         M|   Delhi|
+--------+--------+----------+----------+--------+

In [70]:
# Filter the dataframe
df.filter(col("Emp Dept") == "IT").show()

+--------+--------+----------+----------+--------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|Emp City|
+--------+--------+----------+----------+--------+
|    John|      IT|     45000|         M|   Delhi|
|     Max|      IT|     50000|         M|   Delhi|
|   Jenny|      IT|     75000|         F|   Delhi|
|    Tina|      IT|     85000|         F|   Delhi|
|   Chris|      IT|     40000|         M|   Delhi|
|     Tom|      IT|     45000|         M|   Delhi|
+--------+--------+----------+----------+--------+

In [69]:
# Filter the dataframe
df_2.filter(df_2.Country == "IND").show(5)

+----+---------+---------+----------+--------------------+-------+------+------------+------+
|Year|     City|    Sport|Discipline|             Athlete|Country|Gender|       Event| Medal|
+----+---------+---------+----------+--------------------+-------+------+------------+------+
|1900|    Paris|Athletics| Athletics|   PRITCHARD, Norman|    IND|   Men|        200M|Silver|
|1900|    Paris|Athletics| Athletics|   PRITCHARD, Norman|    IND|   Men|200M Hurdles|Silver|
|1928|Amsterdam|   Hockey|    Hockey|ALLEN, Richard James|    IND|   Men|      Hockey|  Gold|
|1928|Amsterdam|   Hockey|    Hockey|         CHAND, Dyan|    IND|   Men|      Hockey|  Gold|
|1928|Amsterdam|   Hockey|    Hockey| GATELEY, Maurice A.|    IND|   Men|      Hockey|  Gold|
+----+---------+---------+----------+--------------------+-------+------+------------+------+
only showing top 5 rows

In [71]:
df_2.filter("Country == 'IND'").show(5)

+----+---------+---------+----------+--------------------+-------+------+------------+------+
|Year|     City|    Sport|Discipline|             Athlete|Country|Gender|       Event| Medal|
+----+---------+---------+----------+--------------------+-------+------+------------+------+
|1900|    Paris|Athletics| Athletics|   PRITCHARD, Norman|    IND|   Men|        200M|Silver|
|1900|    Paris|Athletics| Athletics|   PRITCHARD, Norman|    IND|   Men|200M Hurdles|Silver|
|1928|Amsterdam|   Hockey|    Hockey|ALLEN, Richard James|    IND|   Men|      Hockey|  Gold|
|1928|Amsterdam|   Hockey|    Hockey|         CHAND, Dyan|    IND|   Men|      Hockey|  Gold|
|1928|Amsterdam|   Hockey|    Hockey| GATELEY, Maurice A.|    IND|   Men|      Hockey|  Gold|
+----+---------+---------+----------+--------------------+-------+------+------------+------+
only showing top 5 rows

In [72]:
# Not Equals to
# df_2.filter("Country != 'IND'").show(5)
df_2.filter("Country <> 'IND'").show(5)

+----+------+--------+----------+------------------+-------+------+--------------------+------+
|Year|  City|   Sport|Discipline|           Athlete|Country|Gender|               Event| Medal|
+----+------+--------+----------+------------------+-------+------+--------------------+------+
|1896|Athens|Aquatics|  Swimming|     HAJOS, Alfred|    HUN|   Men|      100M Freestyle|  Gold|
|1896|Athens|Aquatics|  Swimming|  HERSCHMANN, Otto|    AUT|   Men|      100M Freestyle|Silver|
|1896|Athens|Aquatics|  Swimming| DRIVAS, Dimitrios|    GRE|   Men|100M Freestyle Fo...|Bronze|
|1896|Athens|Aquatics|  Swimming|MALOKINIS, Ioannis|    GRE|   Men|100M Freestyle Fo...|  Gold|
|1896|Athens|Aquatics|  Swimming|CHASAPIS, Spiridon|    GRE|   Men|100M Freestyle Fo...|Silver|
+----+------+--------+----------+------------------+-------+------+--------------------+------+
only showing top 5 rows

In [74]:
df_2.filter((df_2.Country == "IND") & (df_2.Year >= 2000)).show()

+----+-------+-------------+-------------------+--------------------+-------+------+--------------------+------+
|Year|   City|        Sport|         Discipline|             Athlete|Country|Gender|               Event| Medal|
+----+-------+-------------+-------------------+--------------------+-------+------+--------------------+------+
|2000| Sydney|Weightlifting|      Weightlifting|  MALLESWARI, Karnam|    IND| Women|                69KG|Bronze|
|2004| Athens|     Shooting|           Shooting|RATHORE, Rajyavar...|    IND|   Men|Double Trap (150 ...|Silver|
|2008|Beijing|       Boxing|             Boxing|     KUMAR, Vijender|    IND|   Men|          69 - 75 KG|Bronze|
|2008|Beijing|     Shooting|           Shooting|     BINDRA, Abhinav|    IND|   Men|10M Air Rifle (60...|  Gold|
|2008|Beijing|    Wrestling|    Wrestling Free.|       KUMAR, Sushil|    IND|   Men|           60 - 66KG|Bronze|
|2012| London|    Badminton|          Badminton|       NEHWAL, Saina|    IND| Women|             Singles|Bronze|
|2012| London|       Boxing|             Boxing|           KOM, Mary|    IND| Women|               51 KG|Bronze|
|2012| London|     Shooting|           Shooting|       NARANG, Gagan|    IND|   Men|       10M Air Rifle|Bronze|
|2012| London|     Shooting|           Shooting|        KUMAR, Vijay|    IND|   Men|    25M Rapid Pistol|Silver|
|2012| London|    Wrestling|Wrestling Freestyle|     DUTT, Yogeshwar|    IND|   Men|            Wf 60 KG|Bronze|
|2012| London|    Wrestling|Wrestling Freestyle|       KUMAR, Sushil|    IND|   Men|            Wf 66 KG|Silver|
+----+-------+-------------+-------------------+--------------------+-------+------+--------------------+------+

In [76]:
# Sorting in ascending
df.sort("Emp Salary").show()

+--------+--------+----------+----------+--------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|Emp City|
+--------+--------+----------+----------+--------+
|    Nick|      HR|     25000|         M|   Delhi|
|   Shawn|      HR|     35000|         M|   Delhi|
|   Chris|      IT|     40000|         M|   Delhi|
|    John|      IT|     45000|         M|   Delhi|
|     Tom|      IT|     45000|         M|   Delhi|
|     Max|      IT|     50000|         M|   Delhi|
|   Jenny|      IT|     75000|         F|   Delhi|
|    Tina|      IT|     85000|         F|   Delhi|
|     Nat|      HR|    105000|          |   Delhi|
+--------+--------+----------+----------+--------+

In [77]:
# sorting in descending order
df.sort(col("Emp Salary").desc()).show()

+--------+--------+----------+----------+--------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|Emp City|
+--------+--------+----------+----------+--------+
|     Nat|      HR|    105000|          |   Delhi|
|    Tina|      IT|     85000|         F|   Delhi|
|   Jenny|      IT|     75000|         F|   Delhi|
|     Max|      IT|     50000|         M|   Delhi|
|     Tom|      IT|     45000|         M|   Delhi|
|    John|      IT|     45000|         M|   Delhi|
|   Chris|      IT|     40000|         M|   Delhi|
|   Shawn|      HR|     35000|         M|   Delhi|
|    Nick|      HR|     25000|         M|   Delhi|
+--------+--------+----------+----------+--------+

In [78]:
df.sort(col("Emp Salary").desc(), col("Emp Name").asc()).show()

+--------+--------+----------+----------+--------+
|Emp Name|Emp Dept|Emp Salary|Emp Gender|Emp City|
+--------+--------+----------+----------+--------+
|     Nat|      HR|    105000|          |   Delhi|
|    Tina|      IT|     85000|         F|   Delhi|
|   Jenny|      IT|     75000|         F|   Delhi|
|     Max|      IT|     50000|         M|   Delhi|
|    John|      IT|     45000|         M|   Delhi|
|     Tom|      IT|     45000|         M|   Delhi|
|   Chris|      IT|     40000|         M|   Delhi|
|   Shawn|      HR|     35000|         M|   Delhi|
|    Nick|      HR|     25000|         M|   Delhi|
+--------+--------+----------+----------+--------+

In [84]:
df_2.createOrReplaceTempView("Olympics")
spark.sql("select Year, Country, Medal from Olympics").show(5)

+----+-------+------+
|Year|Country| Medal|
+----+-------+------+
|1896|    HUN|  Gold|
|1896|    AUT|Silver|
|1896|    GRE|Bronze|
|1896|    GRE|  Gold|
|1896|    GRE|Silver|
+----+-------+------+
only showing top 5 rows

In [87]:
spark.sql("select Athlete, Country, Medal, Year from Olympics where Country = 'IND' and Year > 2000").show()

+--------------------+-------+------+----+
|             Athlete|Country| Medal|Year|
+--------------------+-------+------+----+
|RATHORE, Rajyavar...|    IND|Silver|2004|
|     KUMAR, Vijender|    IND|Bronze|2008|
|     BINDRA, Abhinav|    IND|  Gold|2008|
|       KUMAR, Sushil|    IND|Bronze|2008|
|       NEHWAL, Saina|    IND|Bronze|2012|
|           KOM, Mary|    IND|Bronze|2012|
|       NARANG, Gagan|    IND|Bronze|2012|
|        KUMAR, Vijay|    IND|Silver|2012|
|     DUTT, Yogeshwar|    IND|Bronze|2012|
|       KUMAR, Sushil|    IND|Silver|2012|
+--------------------+-------+------+----+

In [88]:
df.groupBy("Emp Dept").sum("Emp Salary").show()

+--------+---------------+
|Emp Dept|sum(Emp Salary)|
+--------+---------------+
|      IT|         340000|
|      HR|         165000|
+--------+---------------+

In [90]:
gold_df = df_2.filter("Medal == 'Gold'")

In [91]:
gold_df.show(5)

+----+------+---------+----------+------------------+-------+------+--------------------+-----+
|Year|  City|    Sport|Discipline|           Athlete|Country|Gender|               Event|Medal|
+----+------+---------+----------+------------------+-------+------+--------------------+-----+
|1896|Athens| Aquatics|  Swimming|     HAJOS, Alfred|    HUN|   Men|      100M Freestyle| Gold|
|1896|Athens| Aquatics|  Swimming|MALOKINIS, Ioannis|    GRE|   Men|100M Freestyle Fo...| Gold|
|1896|Athens| Aquatics|  Swimming|     HAJOS, Alfred|    HUN|   Men|     1200M Freestyle| Gold|
|1896|Athens| Aquatics|  Swimming|     NEUMANN, Paul|    AUT|   Men|      400M Freestyle| Gold|
|1896|Athens|Athletics| Athletics|     BURKE, Thomas|    USA|   Men|                100M| Gold|
+----+------+---------+----------+------------------+-------+------+--------------------+-----+
only showing top 5 rows

In [95]:
gold_df.groupBy('Athlete').count().sort(col("count").desc()).show(5)

+----------------+-----+
|         Athlete|count|
+----------------+-----+
| PHELPS, Michael|   18|
|     SPITZ, Mark|    9|
|LATYNINA, Larisa|    9|
|    NURMI, Paavo|    9|
|     LEWIS, Carl|    9|
+----------------+-----+
only showing top 5 rows

In [97]:
gold_df.groupBy('Country').count().sort(col("count").desc()).show(15)

+-------+-----+
|Country|count|
+-------+-----+
|    USA| 2235|
|    URS|  838|
|    GBR|  546|
|    ITA|  476|
|    GER|  452|
|    HUN|  412|
|    FRA|  408|
|    SWE|  349|
|    GDR|  329|
|    AUS|  312|
|    CHN|  290|
|    RUS|  239|
|    NED|  233|
|    JPN|  213|
|    NOR|  209|
+-------+-----+
only showing top 15 rows

In [98]:
from pyspark.sql.functions import sum, avg, count, max, min

In [114]:
df.groupBy("Emp Dept").agg(sum("Emp Salary").alias("Total Salary"),
                          avg("Emp Salary").alias("Avg Salary")).show()

+--------+------------+------------------+
|Emp Dept|Total Salary|        Avg Salary|
+--------+------------+------------------+
|      IT|      340000|56666.666666666664|
|      HR|      165000|           55000.0|
+--------+------------+------------------+